{
  "dragQueens": [
    {
      "name": "RuPaul",
      "realName": "RuPaul Andre Charles",
      "age": 61,
      "city": "San Diego",
      "state": "California",
      "country": "U.S.",
      "famousFor": "Hosting 'RuPaul's Drag Race' and transforming drag into a mainstream phenomenon",
      "image": "img/ru_paul.jpg",
      "bio": "RuPaul Andre Charles, known mononymously as RuPaul, is an American drag queen, actor, model, singer, songwriter, and television personality. He is best known for hosting the reality competition television series 'RuPaul's Drag Race'. RuPaul's trailblazing career has spanned decades, and he is credited with bringing drag culture into the mainstream. Offstage, RuPaul is an advocate for LGBTQ+ rights and has used his platform to promote acceptance and inclusivity. He continues to inspire drag performers worldwide with his charisma, uniqueness, nerve, and talent.",
      "quote": "You better work!",
      "seasons": ["Season 1", "Season 2", "Season 3", "Season 4", "Season 5", "Season 6", "Season 7", "Season 8", "Season 9", "All Stars 1", "All Stars 2", "All Stars 3", "All Stars 4", "All Stars 5", "All Stars 6", "All Stars 7"],
      "trivia": "RuPaul's debut single, 'Supermodel (You Better Work)', became a major hit in the early 1990s and helped propel him to international stardom. He has since released multiple albums and singles, earning several awards and accolades for his music. RuPaul is also a successful entrepreneur, with ventures in fashion, cosmetics, and publishing."
    },
    {
      "name": "Bianca Del Rio",
      "realName": "Roy Haylock",
      "age": 46,
      "city": "New Orleans",
      "state": "Louisiana",
      "country": "U.S.",
      "famousFor": "Winning the sixth season of 'RuPaul's Drag Race'",
      "image": "img/bianca_del_rio.jpg",
      "bio": "Roy Haylock, better known by the stage name Bianca Del Rio, is an American drag queen, comedian, actor, and costume designer. She rose to fame after winning the sixth season of 'RuPaul's Drag Race'. Bianca's sharp wit and irreverent humor have made her a fan favorite in the drag community. Offstage, Roy is known for his philanthropic efforts, supporting various LGBTQ+ charities and organizations. Bianca continues to tour the world with her comedy shows, bringing laughter and joy to audiences everywhere.",
      "quote": "Not today, Satan!",
      "seasons": ["Season 6"],
      "trivia": "Bianca Del Rio's name is a combination of the name of a close friend and a favorite movie character. She is known for her signature catchphrase, 'Not today, Satan!', which has become a popular meme and catchphrase among drag fans."
    },
    {
      "name": "Adore Delano",
      "realName": "Daniel Anthony Noriega",
      "age": 31,
      "city": "Azusa",
      "state": "California",
      "country": "U.S.",
      "famousFor": "Competing on the sixth season of 'RuPaul's Drag Race'",
      "image": "img/adore_delano.jpg",
      "bio": "Daniel Anthony Noriega, better known by the stage name Adore Delano, is an American drag queen, singer, and television personality. She gained popularity as a contestant on the sixth season of 'RuPaul's Drag Race'. Adore's unique blend of punk rock and glam aesthetics has earned her a dedicated fan base. Offstage, Daniel is a talented musician, with multiple albums and singles to her name. Adore continues to perform and release music, showcasing her passion for both drag and music.",
      "quote": "Party!",
      "seasons": ["Season 6", "All Stars 2"],
      "trivia": "Adore Delano first gained national attention as a contestant on 'American Idol' before appearing on 'RuPaul's Drag Race'. She has released several successful albums, including 'Till Death Do Us Party' and 'Whatever'. Adore's music often explores themes of self-expression, empowerment, and LGBTQ+ identity."
    },
    {
      "name": "Shangela Laquifa Wadley",
      "realName": "Darius Jeremy Pierce",
      "age": 40,
      "city": "Paris",
      "state": "Texas",
      "country": "U.S.",
      "famousFor": "Appearing on multiple seasons of 'RuPaul's Drag Race'",
      "image": "img/shangela.png",
      "bio": "Darius Jeremy Pierce, known professionally as Shangela Laquifa Wadley or simply Shangela, is an American drag queen, reality television personality, and actor. She first appeared on 'RuPaul's Drag Race' during its second season and returned for subsequent seasons. Shangela's infectious energy and perseverance have made her a beloved figure in the drag community. Offstage, Darius is also an accomplished actor, with roles in film and television. Shangela continues to inspire others with her resilience, talent, and commitment to authenticity.",
      "quote": "Halleloo!",
      "seasons": ["Season 2", "Season 3", "Season 4"],
      "trivia": "Shangela is the only contestant in 'RuPaul's Drag Race' herstory to compete on three separate seasons: Seasons 2, 3, and 4. She is known for her catchphrase 'Halleloo!', which has become synonymous with her energetic performances and positive attitude."
    },
    {
      "name": "Alyssa Edwards",
      "realName": "Justin Dwayne Lee Johnson",
      "age": 41,
      "city": "Mesquite",
      "state": "Texas",
      "country": "U.S.",
      "famousFor": "Appearing on 'RuPaul's Drag Race' and 'RuPaul's Drag Race: All Stars'",
      "image": "img/alyssa_edwards.png",
      "bio": "Justin Dwayne Lee Johnson, known by the stage name Alyssa Edwards, is an American drag queen, choreographer, and television personality. She gained fame after appearing on the fifth season of 'RuPaul's Drag Race' and its spin-off series 'RuPaul's Drag Race: All Stars'. Alyssa's larger-than-life personality and fierce dance skills have made her a standout queen in the drag world. Offstage, Justin is the founder and artistic director of Beyond Belief Dance Company, where he mentors young dancers. Alyssa continues to entertain audiences with her electrifying performances and captivating presence.",
      "quote": "Backrolls?",
      "seasons": ["Season 5", "All Stars 2", "All Stars 5"],
      "trivia": "Alyssa Edwards is known for her iconic dance style, which she calls 'Alyssa's Secret'. She has toured internationally with her one-woman show, 'Alyssa Edwards: The Secret Is Out', showcasing her talents as both a performer and entertainer."
    },
    {
      "name": "Trixie Mattel",
      "realName": "Brian Michael Firkus",
      "age": 32,
      "city": "Milwaukee",
      "state": "Wisconsin",
      "country": "U.S.",
      "famousFor": "Winning 'RuPaul's Drag Race: All Stars' season 3",
      "image": "img/trixie_mattel.jpg",
      "bio": "Brian Michael Firkus, known by the stage name Trixie Mattel, is an American drag queen, singer-songwriter, and television personality. She gained prominence after competing on the seventh season of 'RuPaul's Drag Race' and winning 'RuPaul's Drag Race: All Stars' season 3. Trixie's unique blend of comedy, music, and distinctive Barbie-inspired aesthetic has garnered her a dedicated fan base. Offstage, Brian is an accomplished musician, with multiple albums and tours showcasing his folk and country-inspired music. Trixie continues to break boundaries in the drag world with her creativity and originality.",
      "quote": "Oh, honey!",
      "seasons": ["Season 7", "All Stars 3"],
      "trivia": "Trixie Mattel is not only a drag queen but also a talented musician. She has released several albums, including 'Two Birds' and 'One Stone', which showcase her skills as a singer-songwriter. Trixie's music often explores themes of love, heartbreak, and personal growth."
    },
    {
      "name": "Katya Zamolodchikova",
      "realName": "Brian Joseph McCook",
      "age": 39,
      "city": "Boston",
      "state": "Massachusetts",
      "country": "U.S.",
      "famousFor": "Competing on 'RuPaul's Drag Race' and 'RuPaul's Drag Race: All Stars'",
      "image": "img/katya_zamolodchikova.jpg",
      "bio": "Brian Joseph McCook, known by the stage name Katya Zamolodchikova or simply Katya, is an American drag queen, comedian, and reality television personality. She gained popularity after competing on the seventh season of 'RuPaul's Drag Race' and 'RuPaul's Drag Race: All Stars' season 2. Katya's eccentric humor and unapologetic authenticity have earned her a devoted following. Offstage, Brian is known for his candid discussions about mental health and addiction, using his platform to raise awareness and promote self-care. Katya continues to push the boundaries of drag, challenging norms and inspiring others to embrace their true selves.",
      "quote": "I'm not joking, bitch!",
      "seasons": ["Season 7", "All Stars 2"],
      "trivia": "Katya's name is inspired by the Russian gymnast Elena Zamolodchikova, whom she admired for her athleticism and poise. She is fluent in both English and Russian, often incorporating Russian phrases and humor into her performances."
    },
    {
      "name": "Jinkx Monsoon",
      "realName": "Jerick Hoffer",
      "age": 33,
      "city": "Portland",
      "state": "Oregon",
      "country": "U.S.",
      "famousFor": "Winning the fifth season of 'RuPaul's Drag Race'",
      "image": "img/jinkx_monsoon.jpg",
      "bio": "Jerick Hoffer, known by the stage name Jinkx Monsoon, is an American drag queen, singer, and actor. She gained fame after winning the fifth season of 'RuPaul's Drag Race'. Jinkx's theatrical performances and powerful vocals have captivated audiences worldwide. Offstage, Jerick is a passionate advocate for LGBTQ+ rights and youth empowerment, using her platform to amplify marginalized voices. Jinkx continues to tour the globe, spreading her message of love, acceptance, and resilience.",
      "quote": "Water off a duck's back!",
      "seasons": ["Season 5", "All Stars 7"],
      "trivia": "Jinkx Monsoon is a skilled accordion player and often incorporates live accordion music into her performances. She developed the character of Jinkx Monsoon during her time studying theater in college, drawing inspiration from classic Hollywood actresses and vaudeville performers."
    },
    {
      "name": "Sasha Velour",
      "realName": "Alexander Hedges Steinberg",
      "age": 34,
      "city": "Berkeley",
      "state": "California",
      "country": "U.S.",
      "famousFor": "Winning the ninth season of 'RuPaul's Drag Race'",
      "image": "img/sasha_velour.jpg",
      "bio": "Alexander Hedges Steinberg, known by the stage name Sasha Velour, is an American drag queen, artist, and television personality. She gained recognition after winning the ninth season of 'RuPaul's Drag Race'. Sasha's avant-garde performances and artistic vision have challenged conventional notions of drag, earning her widespread acclaim. Offstage, Alexander is a passionate advocate for queer visibility in the arts, using her platform to promote diversity and inclusion. Sasha continues to inspire audiences with her creativity, intellect, and bold self-expression.",
      "quote": "Embrace the spectacle!",
      "seasons": ["Season 9"],
      "trivia": "Sasha Velour is the founder and creative director of 'Nightgowns', a critically acclaimed drag showcase in Brooklyn, New York. She is also an accomplished illustrator and has published a book of her artwork titled 'Velour: The Drag Magazine'."
    },
    {
      "name": "Miss Fame",
      "realName": "Kurtis Dam-Mikkelsen",
      "age": 36,
      "city": "Templeton",
      "state": "California",
      "country": "U.S.",
      "famousFor": "Modeling and makeup artistry",
      "image": "img/miss_fame.jpg",
      "bio": "Kurtis Dam-Mikkelsen, known by the stage name Miss Fame, is an American drag queen, model, makeup artist, and recording artist. She gained fame for her high-fashion looks and expertise in makeup artistry. Miss Fame's glamorous aesthetic and attention to detail have made her a sought-after figure in the fashion industry. Offstage, Kurtis is also a talented painter and entrepreneur, with a cosmetics line and a multimedia platform dedicated to beauty and self-expression.",
      "quote": "Beauty is art, and makeup is passion.",
      "seasons": ["Season 7"],
      "trivia": "Miss Fame is a professionally trained makeup artist and has worked with several major fashion brands and celebrities. She launched her own makeup line, 'Miss Fame Beauty', featuring products designed to enhance natural beauty and empower individuals to express themselves through makeup."
    },
    {
      "name": "Bob The Drag Queen",
      "realName": "Caldwell Tidicue",
      "age": 35,
      "city": "Columbus",
      "state": "Georgia",
      "country": "U.S.",
      "famousFor": "Winning the eighth season of 'RuPaul's Drag Race'",
      "image": "img/bob_the_drag_queen.jpg",
      "bio": "Caldwell Tidicue, known by the stage name Bob The Drag Queen, is an American drag queen, comedian, and reality television personality. She gained recognition after winning the eighth season of 'RuPaul's Drag Race'. Bob's quick wit and infectious energy have made her a beloved figure in the drag community. Offstage, Caldwell is also an outspoken activist, advocating for LGBTQ+ rights and racial justice. Bob continues to use her platform to uplift marginalized voices and create positive change.",
      "quote": "Purse first!",
      "seasons": ["Season 8"],
      "trivia": "Bob The Drag Queen is an accomplished stand-up comedian and has performed at comedy clubs and festivals across the United States. She is also an outspoken advocate for HIV/AIDS awareness and prevention, using her platform to educate and destigmatize conversations about sexual health."
    },
    {
      "name": "Kim Chi",
      "realName": "Sang-Young Shin",
      "age": 34,
      "city": "Chicago",
      "state": "Illinois",
      "country": "U.S.",
      "famousFor": "Finalist on the eighth season of 'RuPaul's Drag Race'",
      "image": "img/kim_chi.jpg",
      "bio": "Sang-Young Shin, known by the stage name Kim Chi, is a Korean-American drag queen, artist, and fashion designer. She gained fame as a finalist on the eighth season of 'RuPaul's Drag Race' for her unique and avant-garde style. Kim Chi's bold and innovative approach to drag has earned her acclaim from fans and critics alike. Offstage, Sang-Young is also an accomplished illustrator, with a distinctive aesthetic that blends traditional Korean art with contemporary pop culture.",
      "quote": "Why y'all acting brand new?",
      "seasons": ["Season 8"],
      "trivia": "Kim Chi is an avid gamer and has a passion for cosplay, often incorporating video game and anime references into her drag performances. She is also a skilled seamstress and has designed costumes for several drag queens and celebrities."
    }
  ]    
}